In [7]:
import pandas as pd

In [10]:
pd.Series([1,2,3,4,5,6], index=['a','b','c','d','e','f'])

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [14]:
data = [[1,444, 'abc' ],
[2,555,'def'],
[3,666, 'ghi' ],
[4,444, 'xyz' ]
]
df = pd.DataFrame(data, columns=['id','salary','dept'])
x = df.columns
display(df)
index = ['R1', 'R2' , 'R3' , 'R4' ]
df.index = index
display(df)

   id  salary dept
0   1     444  abc
1   2     555  def
2   3     666  ghi
3   4     444  xyz

    id  salary dept
R1   1     444  abc
R2   2     555  def
R3   3     666  ghi
R4   4     444  xyz

In [16]:
df['dept'] = df['dept'].astype('category')

In [17]:
df['dept'].dtype

CategoricalDtype(categories=['abc', 'def', 'ghi', 'xyz'], ordered=False, categories_dtype=str)

In [18]:
df.dtypes

id           int64
salary       int64
dept      category
dtype: object